# Pandas Series.values_count()

In [2]:
'''

the value count function return the series that contain count of unique value 
OR
in a simple word how many time each character or string or number occured
OR 
occurence of each items


'''

'\n\nthe value count function return the series that contain count of unique value \nOR\nin a simple word how many time each character or string or number occured\nOR \noccurence of each items\n\n\n'

In [1]:
# importing essentials
import pandas as pd 
import numpy as np

In [19]:
# lets take an exaple of top 7 restorent and bar in pune and thier avrage bill
data = pd.DataFrame(
                    [('The market','restorent',1999),
                     ('ukiyo','restorent',1559),
                     ('The bharkhana','Bar',1300),
                     ('paasha','restorent',1600),
                     ('bird valley','Bar',1200),
                     ('Betos','Bar',1500),
                     ('ukiyo','restorent',1559),
                     ('thikana','Bar',1300),
                     ('Aasmana','restorent',1111),
                     ('The market','restorent',1999),
                     ('bird valley','Bar',1200),
                     ('ukiyo','restorent',1559),
                     ('linkin barrel','Bar',800),
                     ('spice kitchen','restorent',1199),
                     ('alto vino','restorent',1000),
                     ('publiq','Bar',1499),
                     ('The market','restorent',1999),
                     ('spice kitchen','restorent',1199),
                     ('cafe blue','restorent',1129),
                     ('publiq','Bar',1499),
                     ('Aasmana','restorent',1111)],
                    
                    columns=('Name','Type','AvgBill')
                   )
data

             Name       Type  AvgBill
0      The market  restorent     1999
1           ukiyo  restorent     1559
2   The bharkhana        Bar     1300
3          paasha  restorent     1600
4     bird valley        Bar     1200
5           Betos        Bar     1500
6           ukiyo  restorent     1559
7         thikana        Bar     1300
8         Aasmana  restorent     1111
9      The market  restorent     1999
10    bird valley        Bar     1200
11          ukiyo  restorent     1559
12  linkin barrel        Bar      800
13  spice kitchen  restorent     1199
14      alto vino  restorent     1000
15         publiq        Bar     1499
16     The market  restorent     1999
17  spice kitchen  restorent     1199
18      cafe blue  restorent     1129
19         publiq        Bar     1499
20        Aasmana  restorent     1111

In [20]:
# counting the frequency of unique value in series
data['Name'].value_counts()

The market       3
ukiyo            3
bird valley      2
Aasmana          2
spice kitchen    2
publiq           2
The bharkhana    1
paasha           1
Betos            1
thikana          1
linkin barrel    1
alto vino        1
cafe blue        1
Name: Name, dtype: int64

In [21]:
# tacking them in assendening order
data['Name'].value_counts(ascending=True)

The bharkhana    1
paasha           1
Betos            1
thikana          1
linkin barrel    1
alto vino        1
cafe blue        1
bird valley      2
Aasmana          2
spice kitchen    2
publiq           2
The market       3
ukiyo            3
Name: Name, dtype: int64

## Counting relative frequency of unique values in a series (normalizing)

### if we dodn't want to get the count of each unique value, but rather see how frequent each value appears 
### compared to the whole series. In order to do this, we'll set normalize=True

In [22]:
data['Name'].value_counts(normalize=True)

The market       0.142857
ukiyo            0.142857
bird valley      0.095238
Aasmana          0.095238
spice kitchen    0.095238
publiq           0.095238
The bharkhana    0.047619
paasha           0.047619
Betos            0.047619
thikana          0.047619
linkin barrel    0.047619
alto vino        0.047619
cafe blue        0.047619
Name: Name, dtype: float64